public class Task3 {
    public static void main(String[] args) {
//        Задача 3: Да се изведат на екрана всички нечетни числа от -10
//        до 10
        int a=-10;
        while (a<=10){
            if(a%2!=0){
                System.out.println(a);
               }
        a++;
        }
    }
}
