public class Task1 {
    public static void main(String[] args) {
//Задача 1: Да се изведат на екрана числата от 1 до 100.
        for (int i = 0; i < 100; i++) {
            System.out.println(i+1);
        }

    }
}
