public class Figure1 {
    public static void main(String[] args) {
//        Задача 1​: Въведете число N чрез конзолата и изкарайте като
//резултат следната матрица с височина N и широчина N
//# # # # #
//# # # # #
//# # # # #
//# # # # #
//# # # # #
        int num=5;
        for (int i = 0; i < num; i++) {
            for (int j = 0; j < num; j++) {
                System.out.print("#");
            }
            System.out.println();

        }
    }
}
